
#include<stdio.h>// I/O
#include <windows.h>// 콘솔화면크키 조절 및 색상 조절, 기다리기 
#include <stdlib.h> // exit(),rand()
#include <time.h> // srand(time(NULL));

char computer_upgrade[10][100] = { "애니악", "98년도컴퓨터","콩순이컴퓨터", "학교노트북", "학교컴퓨터", "강화된학교노트북(불법)" , "가정용컴퓨터", "게이밍노트북", "게이밍컴퓨터","슈퍼컴퓨터" };
int i = 0;
int fraud = 0;
int cash = 200;
void pol()
{
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE),2); 
	printf("########@@@@@$=*=$*@@@@@@@======#@@@@@@@@@@#@@@#*$\n");
	printf("#######@@@@@@@$*=$=@@@@@@@*$*$*=@@@@@@@@@@@#@@#**#\n");
	printf("######@@#@@@@@@$=$=@@@@@@@$===@@@@@@#####@@#@=**##\n");
	printf("######@###@@@@@@@@$$@@@@#*=@@@@@@@@@#######$**=###\n");
	printf("#########=@@@@@@@@$*=$$=**=@@@@@@@#####@#===######\n");
	printf("#########*=$@@@@@@@##@@@@@@@@@@@@@##@#!!$=########\n");
	printf("#########!$$=$##@@@@@@@@@@@@@@@##$**!=!!=!$#######\n");
	printf("#########$;;*==**=$$#####$$$$**==**!;=;:;=$$$#####\n");
	printf("##########!=;!;*====$=*$$$=====!::=~~~!;!=$$$#@@##\n");
	printf("#####@#@###:;;::$;;=**=*!;*;::;:~-**!*-*$$$$######\n");
	printf("####=$######!;*;=::*:::!:::*;;*!:~~~:$$$$$######@#\n");
	printf("###=*$########*::!;!!!!;!!!:;::::~=$====$$$$####@$\n");
	printf("$$#**$##==$######=$=!;;;;;!=$$$#*:===$$$$$$$#####$\n");
	printf("$$**==$*=:::$####$$#############!:=$=$===$$$####@$\n");
	printf("##******;::;; ~##$$#############;--!*=======$###@$\n");
	printf("$$*=****:=*     !:$$#@######=:~:~.-~!=======$###@$\n");
	printf("$**=****!=      .*$$##*::,       .--~=======$$##~~\n");
	printf("$*!******-       *~--~~-.        .--,***====$#$@!~\n");
	printf("$*!*!****   :@!  !~--~~:          $,,;***===$$$#;;\n");
	printf("$*!!!!*!!   #-@  !!;:;*      .!   *,,,****==$$$:*;\n");
	printf("$*!!!**!;  ,*~@  *;;::;      @**  :,,,,=**==$$$-,*\n");
	printf("=$*!!=!!:  ;@@@ .!;;;::     $ -$  ~,,,,,=*=$$$~--:\n");
	printf("=$!!!=!!:  :@@# -;;;;:-     #-#$  ;,,,,,,*=$$=--,~\n");
	printf("***!=!!!;   @@. =;;;;:,     @@#*  ;,,,,,,!=$$--,,~\n");
	printf("**==!!!!!   .  ,;;;;;;,     #@$~  ,,,,,,,;=$:--,,:\n");
	printf("**$!=$$$!:    ,;;;:-~;~     ~#=  .,,,,,,,:=:--,,--\n");
	printf("!!=!=$=!!!*--=;;!*!;-;;           ,.,,,,,:;---,,--\n");
	printf("!!*!**!!!!;;;;!@@@@@~-!           ,::::,,,---,,---\n");
	printf("!!$!!!$=;!;;;;$= ,@@@-:-       ;  ..-~:.,,,~,,,---\n");
	printf("!!*!!=$;-!:;;:####@@@$-;:....*--  ....-..,,!,,,--:\n");
	printf("!!!!!*=--!~-;;*#####@=~-~~::-,..  --......,;.,,,-!\n");
	printf("!!!*!!~---:~,-~;*=$=*;;;:.,,...   ,,,......~.,,.!:\n");
	printf("!!!!=;-----;!*;.,,,,,,,,,.....    ,,.   ....,,;:~~\n");
	printf("!!!!!!~-----*!!=~~!*:~------..    ..     .,:;~~~~~\n");
	printf("!!!;;!:-----=!:------,,.,,               .,-,-----\n");
	printf("!!!!;;;!----;!~-----,,.,..              .,--.,,---0\n");
	printf("!!!;;;::*---~;~----,,.,..              ,.,--..,,,,\n");
	printf(";;;;;;;;$=~:-;~~--,,.,.               ...,,,....,,\n");
	printf(";;;;;;;;##$=,:----,.,.                  ..,,......\n");
	printf(";;;;;;:;###=;-~-,,.-. .  .               .., .  ..\n");
	printf(";;;;:::=###$=--;:~.  ,,..                 ..     .\n");
	printf(";;;::::@#@$$$=~,....,....                 ...    .\n");
	printf("::::::=###$$$#$*;~-,,,..                   ..   \n");
	printf(":::::~###$$##$$*!~,-,,..                   ..  \n");
	printf(":::::=###$$$#$*!!~-,,...                   ...    \n");
	printf(":::::###$$$$##=*;~,,,,..                   ...   \n");
	printf("::::;##@$$$$#$=!;~,,,,..                   ....   \n");
	printf(";!;:*###$$$##=*!:~,,,,..                   ..,,  \n");
	printf("!!:~*##$$$$@#$=!:~,,,,..                   ..,,   \n");
	printf("~~~~*#@$$$$#$=**:~-,,,,..                 ..,,, \n");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 7);
}

void game()
{
	int cun = 0;
	int rdp;
	int rd;
	int en = 0;
	int loser = 0;
	int lol;
	int en2 = 0;
	srand(time(NULL));
	while (1)
	{
		printf("------------------------------------------\n");
		if (i == 9)
		{
			printf("축하합니다 이제 남부럽지않은 %s가 되었습니다!!!!!!!!\n",computer_upgrade[i]);
			printf("시도 횟수 :  %d\n", cun);
			printf("남은 자금 : %d\n", cash);
			printf("조작으로 사용한 돈 : %d\n", fraud);
			if(fraud >=1500)
			{
				printf("조작을 너무 많이 하신거 아닌가요?\n다음에는 조작을 덜 하시면 좋겠네요\n");
			}
			printf("------------------------------------------\n");
			printf("플레이 해주셔서 감사합니다.");
			exit(0);
		}

		if (cash <= 0)
		{
			pol();
			printf("%s를 사다가 파산했습니다.", computer_upgrade[i + 1]);
			exit(0);
		}
		printf("현재 컴퓨터 : %s \n", computer_upgrade[i]);
		printf("현재 자금 : %d\n", cash);
		rd = rand() % 100;

		if (en == 2) 
		{
			rd = en2;
		} 
		else
		{
		if(i == 0)
		{
			if (rd <= 50)
			{
				rd+=40;
			}
		}
		else if (i == 1)
		{
			if (rd <= 50)
			{
			}
			else rd -= 10;

		}
		else if (i == 2)
		{
			if (rd <= 45)
			{
			}
			else rd -= 15;
		}
		else if (i == 3)
		{
			if (rd <= 40)
			{
			}
			else rd -= 20;
		}
		else if (i == 4)
		{
			if (rd <= 40)
			{
			}
			else rd -= 30;
		}
		else if (i == 5)
		{
			if (rd <= 40)
			{
			}
			else rd -= 35;
		}
		else if (i >= 6)
		{
			if (rd <= 40)
			{
			}
			else rd -= 40;
		}
		}

		printf("성공 확률 %d%%입니다\n", rd);
		
		printf("강화하실려면 1번\n성공확률 높이려면 2번을 누르세요.");
		scanf("%d", &en);
		system("cls");
		printf("------------------------------------------\n");
		
		if (en == 1)
		{
			++cun;

			rdp = rand() % 100;

			if (rdp <= rd)
			{
				++i;
				printf("강화성공!\n");
				cash += 300;
			}
			else
			{
				loser = rand() % 5;
				if (loser <= 3)
				{
					printf("강화를 실패 했습니다.\n");
					cash -= 50;
				}
				else
				{
					lol = rand() % 6;
					
					if (lol == 1)
					{
						printf("강화를 하다가 손이 미끄러져 %s를 부쉈습니다.",computer_upgrade[i]);
						exit(0);
					}
					else if (lol == 2)
					{
						printf("강화를 하다가 옆에 있던 커피를 %s에 쏟아 고장났습니다.", computer_upgrade[i]);
						exit(0);
					}
					else if (lol == 3)
					{	
						printf("강화를 하니 %s이/가 터졌습니다.", computer_upgrade[i]);
						exit(0);
					}
					else if (lol == 4)
					{
						printf("강화를 하다 화가나서 부쉈습니다");
						exit(0);
					}
					else if (lol == 5)
					{
						printf("강화를 하는데 실수로 램 슬롯을 부쉈습니다.");
						exit(0);
					}
					else if (lol == 6)
					{
						printf("명절에 조카가 와서 %s에 물을 부었습니다.", computer_upgrade[i]);
						exit(0);
					}
				}

			}
		}
		else if (en == 2)
		{
			en2 = rd;
			en2 += 10;
			cash -= 150;
			printf("확률을 조작하여 10%%를 올렸습니다.\n");
			fraud+=150;
		}
		else
		{
			printf("강화를 포기합니다.");
			exit(0);
		}

	}
}



	int main() 
	{
		int yorn = 2;
		system("mode con cols=100 lines=300"); 
		printf("\n------------------------------------------\n");
		printf("컴퓨터 강화 게임 \nMade by 김찬민 \nwho helped with the idea 김성훈\n");
		printf("------------------------------------------\n");
		printf("시작할꺼면 ""1"" 종료할꺼면 ""0""을 누르세요 : ");
		scanf("%d", &yorn);
		if (yorn == 0)
		{
			printf("프로그램을 종료합니다.");
			exit(0);
		}
		else if (yorn == 1)
		{
			printf("게임을 시작합니다.\n");
			Sleep(1000);
			system("cls");
			game();
		}
		else
		{
			printf("비이상적인 입력으로 프로그램을 종료합니다.");
			exit(1);
		}
	}

